; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=400, out_folder=./training, instance_id=28, seed=2052, goal_proportion=0.03

(define (problem blocksworld-28)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 b400 - object)
 (:init 
    (arm-empty)
    (clear b152)
    (on-table b152)
    (clear b243)
    (on b243 b317)
    (on b317 b16)
    (on b16 b202)
    (on b202 b235)
    (on b235 b96)
    (on b96 b176)
    (on b176 b359)
    (on b359 b347)
    (on b347 b136)
    (on b136 b89)
    (on b89 b3)
    (on b3 b388)
    (on b388 b320)
    (on b320 b138)
    (on b138 b387)
    (on b387 b141)
    (on b141 b390)
    (on b390 b395)
    (on b395 b58)
    (on-table b58)
    (clear b376)
    (on b376 b183)
    (on-table b183)
    (clear b191)
    (on b191 b28)
    (on b28 b61)
    (on b61 b292)
    (on b292 b305)
    (on b305 b102)
    (on b102 b112)
    (on-table b112)
    (clear b310)
    (on-table b310)
    (clear b308)
    (on-table b308)
    (clear b297)
    (on b297 b99)
    (on b99 b47)
    (on b47 b107)
    (on b107 b240)
    (on b240 b59)
    (on b59 b128)
    (on b128 b290)
    (on b290 b14)
    (on-table b14)
    (clear b6)
    (on b6 b157)
    (on b157 b160)
    (on-table b160)
    (clear b60)
    (on-table b60)
    (clear b117)
    (on-table b117)
    (clear b371)
    (on b371 b256)
    (on b256 b118)
    (on b118 b249)
    (on-table b249)
    (clear b393)
    (on-table b393)
    (clear b172)
    (on b172 b250)
    (on b250 b344)
    (on b344 b241)
    (on b241 b389)
    (on b389 b72)
    (on b72 b33)
    (on b33 b248)
    (on b248 b161)
    (on-table b161)
    (clear b121)
    (on b121 b135)
    (on b135 b85)
    (on b85 b234)
    (on b234 b46)
    (on b46 b4)
    (on-table b4)
    (clear b44)
    (on b44 b259)
    (on b259 b201)
    (on b201 b209)
    (on b209 b74)
    (on b74 b181)
    (on b181 b119)
    (on b119 b215)
    (on b215 b10)
    (on b10 b238)
    (on-table b238)
    (clear b316)
    (on b316 b313)
    (on b313 b43)
    (on b43 b162)
    (on b162 b2)
    (on-table b2)
    (clear b233)
    (on b233 b337)
    (on b337 b40)
    (on b40 b279)
    (on b279 b196)
    (on b196 b147)
    (on-table b147)
    (clear b19)
    (on b19 b229)
    (on b229 b396)
    (on b396 b350)
    (on b350 b361)
    (on-table b361)
    (clear b23)
    (on-table b23)
    (clear b144)
    (on-table b144)
    (clear b236)
    (on b236 b227)
    (on b227 b262)
    (on b262 b146)
    (on-table b146)
    (clear b139)
    (on b139 b95)
    (on b95 b125)
    (on b125 b104)
    (on b104 b22)
    (on b22 b90)
    (on b90 b319)
    (on-table b319)
    (clear b142)
    (on-table b142)
    (clear b194)
    (on b194 b75)
    (on b75 b374)
    (on-table b374)
    (clear b120)
    (on-table b120)
    (clear b383)
    (on b383 b398)
    (on b398 b260)
    (on b260 b304)
    (on b304 b17)
    (on-table b17)
    (clear b231)
    (on b231 b247)
    (on b247 b78)
    (on b78 b200)
    (on b200 b109)
    (on b109 b131)
    (on b131 b177)
    (on b177 b195)
    (on b195 b386)
    (on b386 b27)
    (on b27 b88)
    (on b88 b286)
    (on b286 b368)
    (on-table b368)
    (clear b394)
    (on-table b394)
    (clear b221)
    (on b221 b327)
    (on-table b327)
    (clear b30)
    (on b30 b178)
    (on b178 b187)
    (on b187 b322)
    (on b322 b369)
    (on-table b369)
    (clear b45)
    (on b45 b278)
    (on-table b278)
    (clear b80)
    (on-table b80)
    (clear b159)
    (on b159 b222)
    (on b222 b42)
    (on b42 b225)
    (on b225 b35)
    (on b35 b268)
    (on b268 b158)
    (on b158 b175)
    (on b175 b364)
    (on b364 b20)
    (on b20 b52)
    (on b52 b382)
    (on b382 b288)
    (on-table b288)
    (clear b299)
    (on b299 b122)
    (on b122 b294)
    (on b294 b126)
    (on-table b126)
    (clear b323)
    (on b323 b39)
    (on b39 b93)
    (on-table b93)
    (clear b123)
    (on b123 b132)
    (on b132 b218)
    (on b218 b276)
    (on-table b276)
    (clear b300)
    (on b300 b18)
    (on b18 b113)
    (on b113 b258)
    (on b258 b339)
    (on-table b339)
    (clear b193)
    (on b193 b367)
    (on b367 b12)
    (on b12 b148)
    (on-table b148)
    (clear b282)
    (on b282 b204)
    (on b204 b385)
    (on-table b385)
    (clear b51)
    (on b51 b83)
    (on-table b83)
    (clear b192)
    (on b192 b71)
    (on b71 b145)
    (on b145 b354)
    (on b354 b253)
    (on b253 b273)
    (on b273 b29)
    (on b29 b67)
    (on b67 b1)
    (on b1 b309)
    (on b309 b349)
    (on-table b349)
    (clear b73)
    (on b73 b124)
    (on b124 b242)
    (on b242 b346)
    (on-table b346)
    (clear b246)
    (on b246 b264)
    (on b264 b66)
    (on b66 b36)
    (on b36 b56)
    (on b56 b365)
    (on-table b365)
    (clear b379)
    (on-table b379)
    (clear b87)
    (on b87 b210)
    (on b210 b399)
    (on b399 b391)
    (on b391 b224)
    (on b224 b165)
    (on b165 b205)
    (on b205 b357)
    (on b357 b328)
    (on b328 b312)
    (on b312 b167)
    (on-table b167)
    (clear b189)
    (on b189 b351)
    (on-table b351)
    (clear b143)
    (on-table b143)
    (clear b84)
    (on-table b84)
    (clear b232)
    (on b232 b155)
    (on b155 b330)
    (on b330 b79)
    (on-table b79)
    (clear b284)
    (on b284 b318)
    (on b318 b265)
    (on b265 b314)
    (on b314 b237)
    (on b237 b380)
    (on b380 b331)
    (on b331 b329)
    (on b329 b64)
    (on b64 b270)
    (on b270 b208)
    (on b208 b355)
    (on-table b355)
    (clear b9)
    (on-table b9)
    (clear b370)
    (on b370 b255)
    (on-table b255)
    (clear b153)
    (on b153 b228)
    (on-table b228)
    (clear b101)
    (on b101 b280)
    (on-table b280)
    (clear b211)
    (on b211 b285)
    (on b285 b230)
    (on-table b230)
    (clear b298)
    (on b298 b213)
    (on b213 b15)
    (on-table b15)
    (clear b169)
    (on b169 b130)
    (on-table b130)
    (clear b340)
    (on b340 b76)
    (on b76 b333)
    (on-table b333)
    (clear b341)
    (on b341 b173)
    (on-table b173)
    (clear b37)
    (on b37 b295)
    (on b295 b363)
    (on b363 b277)
    (on-table b277)
    (clear b13)
    (on-table b13)
    (clear b325)
    (on-table b325)
    (clear b69)
    (on b69 b54)
    (on b54 b254)
    (on-table b254)
    (clear b140)
    (on b140 b348)
    (on b348 b334)
    (on-table b334)
    (clear b306)
    (on b306 b166)
    (on-table b166)
    (clear b150)
    (on-table b150)
    (clear b149)
    (on b149 b266)
    (on-table b266)
    (clear b171)
    (on b171 b302)
    (on b302 b199)
    (on-table b199)
    (clear b63)
    (on b63 b8)
    (on-table b8)
    (clear b226)
    (on b226 b116)
    (on b116 b353)
    (on-table b353)
    (clear b311)
    (on b311 b239)
    (on b239 b274)
    (on b274 b92)
    (on b92 b154)
    (on b154 b287)
    (on b287 b134)
    (on b134 b97)
    (on b97 b338)
    (on b338 b81)
    (on-table b81)
    (clear b179)
    (on b179 b271)
    (on b271 b326)
    (on-table b326)
    (clear b82)
    (on b82 b378)
    (on b378 b174)
    (on b174 b21)
    (on b21 b186)
    (on b186 b105)
    (on b105 b188)
    (on-table b188)
    (clear b156)
    (on b156 b94)
    (on b94 b315)
    (on b315 b133)
    (on b133 b252)
    (on b252 b358)
    (on b358 b392)
    (on b392 b362)
    (on-table b362)
    (clear b137)
    (on-table b137)
    (clear b182)
    (on-table b182)
    (clear b261)
    (on b261 b98)
    (on b98 b62)
    (on b62 b281)
    (on b281 b38)
    (on b38 b397)
    (on b397 b190)
    (on b190 b163)
    (on b163 b223)
    (on b223 b307)
    (on b307 b220)
    (on b220 b335)
    (on b335 b343)
    (on b343 b356)
    (on b356 b185)
    (on b185 b115)
    (on-table b115)
    (clear b375)
    (on-table b375)
    (clear b26)
    (on b26 b91)
    (on b91 b219)
    (on-table b219)
    (clear b86)
    (on b86 b296)
    (on b296 b377)
    (on-table b377)
    (clear b65)
    (on-table b65)
    (clear b55)
    (on-table b55)
    (clear b77)
    (on b77 b151)
    (on b151 b53)
    (on b53 b269)
    (on b269 b360)
    (on-table b360)
    (clear b184)
    (on b184 b110)
    (on-table b110)
    (clear b400)
    (on b400 b372)
    (on b372 b244)
    (on b244 b324)
    (on b324 b57)
    (on b57 b303)
    (on b303 b216)
    (on-table b216)
    (clear b289)
    (on b289 b100)
    (on-table b100)
    (clear b25)
    (on-table b25)
    (clear b217)
    (on b217 b48)
    (on-table b48)
    (clear b373)
    (on-table b373)
    (clear b251)
    (on b251 b68)
    (on b68 b180)
    (on-table b180)
    (clear b197)
    (on b197 b366)
    (on b366 b41)
    (on b41 b214)
    (on b214 b31)
    (on b31 b283)
    (on-table b283)
    (clear b257)
    (on b257 b381)
    (on-table b381)
    (clear b103)
    (on b103 b212)
    (on b212 b272)
    (on b272 b321)
    (on b321 b129)
    (on b129 b168)
    (on-table b168)
    (clear b32)
    (on b32 b5)
    (on b5 b24)
    (on b24 b106)
    (on b106 b301)
    (on-table b301)
    (clear b207)
    (on-table b207)
    (clear b127)
    (on b127 b332)
    (on b332 b111)
    (on-table b111)
    (clear b164)
    (on b164 b7)
    (on b7 b108)
    (on b108 b49)
    (on b49 b345)
    (on b345 b245)
    (on-table b245)
    (clear b203)
    (on-table b203)
    (clear b267)
    (on b267 b70)
    (on b70 b384)
    (on b384 b293)
    (on b293 b50)
    (on b50 b291)
    (on b291 b198)
    (on b198 b34)
    (on-table b34)
    (clear b114)
    (on b114 b11)
    (on-table b11)
    (clear b336)
    (on b336 b275)
    (on b275 b352)
    (on b352 b206)
    (on b206 b263)
    (on-table b263)
    (clear b170)
    (on b170 b342)
    (on-table b342))
 (:goal  (and 
    (clear b10)
    (on b10 b9)
    (on b9 b11)
    (on b11 b1)
    (on b1 b7)
    (on b7 b12)
    (on b12 b3)
    (on b3 b4)
    (on b4 b6)
    (on-table b6)
    (clear b5)
    (on-table b5)
    (clear b2)
    (on b2 b8)
    (on-table b8))))

; plan
1. (unstack b6 b157)
   deleted: (on b6 b157) (clear b6) (arm-empty)
   added: (holding b6) (clear b157)
   goals met: 1 of 15
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 15
3. (unstack b114 b11)
   deleted: (on b114 b11) (clear b114) (arm-empty)
   added: (holding b114) (clear b11)
   goals met: 2 of 15
4. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 2 of 15
5. (unstack b121 b135)
   deleted: (on b121 b135) (clear b121) (arm-empty)
   added: (holding b121) (clear b135)
   goals met: 2 of 15
6. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 2 of 15
7. (unstack b135 b85)
   deleted: (on b135 b85) (clear b135) (arm-empty)
   added: (holding b135) (clear b85)
   goals met: 2 of 15
8. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 2 of 15
9. (unstack b164 b7)
   deleted: (on b164 b7) (clear b164) (arm-empty)
   added: (holding b164) (clear b7)
   goals met: 2 of 15
10. (putdown b164)
   deleted: (holding b164)
   added: (clear b164) (arm-empty) (on-table b164)
   goals met: 2 of 15
11. (unstack b192 b71)
   deleted: (on b192 b71) (clear b192) (arm-empty)
   added: (holding b192) (clear b71)
   goals met: 2 of 15
12. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 2 of 15
13. (unstack b193 b367)
   deleted: (on b193 b367) (clear b193) (arm-empty)
   added: (holding b193) (clear b367)
   goals met: 2 of 15
14. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 2 of 15
15. (unstack b243 b317)
   deleted: (on b243 b317) (clear b243) (arm-empty)
   added: (holding b243) (clear b317)
   goals met: 2 of 15
16. (putdown b243)
   deleted: (holding b243)
   added: (clear b243) (arm-empty) (on-table b243)
   goals met: 2 of 15
17. (unstack b316 b313)
   deleted: (on b316 b313) (clear b316) (arm-empty)
   added: (holding b316) (clear b313)
   goals met: 2 of 15
18. (putdown b316)
   deleted: (holding b316)
   added: (clear b316) (arm-empty) (on-table b316)
   goals met: 2 of 15
19. (unstack b313 b43)
   deleted: (on b313 b43) (clear b313) (arm-empty)
   added: (holding b313) (clear b43)
   goals met: 2 of 15
20. (putdown b313)
   deleted: (holding b313)
   added: (clear b313) (arm-empty) (on-table b313)
   goals met: 2 of 15
21. (unstack b317 b16)
   deleted: (on b317 b16) (clear b317) (arm-empty)
   added: (holding b317) (clear b16)
   goals met: 2 of 15
22. (putdown b317)
   deleted: (holding b317)
   added: (clear b317) (arm-empty) (on-table b317)
   goals met: 2 of 15
23. (unstack b16 b202)
   deleted: (on b16 b202) (clear b16) (arm-empty)
   added: (holding b16) (clear b202)
   goals met: 2 of 15
24. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 15
25. (unstack b202 b235)
   deleted: (on b202 b235) (clear b202) (arm-empty)
   added: (holding b202) (clear b235)
   goals met: 2 of 15
26. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 2 of 15
27. (unstack b235 b96)
   deleted: (on b235 b96) (clear b235) (arm-empty)
   added: (holding b235) (clear b96)
   goals met: 2 of 15
28. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 2 of 15
29. (unstack b32 b5)
   deleted: (on b32 b5) (clear b32) (arm-empty)
   added: (holding b32) (clear b5)
   goals met: 3 of 15
30. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 3 of 15
31. (unstack b5 b24)
   deleted: (on b5 b24) (clear b5) (arm-empty)
   added: (holding b5) (clear b24)
   goals met: 2 of 15
32. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 15
33. (unstack b367 b12)
   deleted: (on b367 b12) (clear b367) (arm-empty)
   added: (holding b367) (clear b12)
   goals met: 4 of 15
34. (putdown b367)
   deleted: (holding b367)
   added: (clear b367) (arm-empty) (on-table b367)
   goals met: 4 of 15
35. (unstack b43 b162)
   deleted: (on b43 b162) (clear b43) (arm-empty)
   added: (holding b43) (clear b162)
   goals met: 4 of 15
36. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 4 of 15
37. (unstack b162 b2)
   deleted: (on b162 b2) (clear b162) (arm-empty)
   added: (holding b162) (clear b2)
   goals met: 5 of 15
38. (putdown b162)
   deleted: (holding b162)
   added: (clear b162) (arm-empty) (on-table b162)
   goals met: 5 of 15
39. (unstack b44 b259)
   deleted: (on b44 b259) (clear b44) (arm-empty)
   added: (holding b44) (clear b259)
   goals met: 5 of 15
40. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 5 of 15
41. (unstack b259 b201)
   deleted: (on b259 b201) (clear b259) (arm-empty)
   added: (holding b259) (clear b201)
   goals met: 5 of 15
42. (putdown b259)
   deleted: (holding b259)
   added: (clear b259) (arm-empty) (on-table b259)
   goals met: 5 of 15
43. (unstack b201 b209)
   deleted: (on b201 b209) (clear b201) (arm-empty)
   added: (holding b201) (clear b209)
   goals met: 5 of 15
44. (putdown b201)
   deleted: (holding b201)
   added: (clear b201) (arm-empty) (on-table b201)
   goals met: 5 of 15
45. (unstack b209 b74)
   deleted: (on b209 b74) (clear b209) (arm-empty)
   added: (holding b209) (clear b74)
   goals met: 5 of 15
46. (putdown b209)
   deleted: (holding b209)
   added: (clear b209) (arm-empty) (on-table b209)
   goals met: 5 of 15
47. (unstack b63 b8)
   deleted: (on b63 b8) (clear b63) (arm-empty)
   added: (holding b63) (clear b8)
   goals met: 5 of 15
48. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 5 of 15
49. (unstack b71 b145)
   deleted: (on b71 b145) (clear b71) (arm-empty)
   added: (holding b71) (clear b145)
   goals met: 5 of 15
50. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 5 of 15
51. (unstack b145 b354)
   deleted: (on b145 b354) (clear b145) (arm-empty)
   added: (holding b145) (clear b354)
   goals met: 5 of 15
52. (putdown b145)
   deleted: (holding b145)
   added: (clear b145) (arm-empty) (on-table b145)
   goals met: 5 of 15
53. (unstack b354 b253)
   deleted: (on b354 b253) (clear b354) (arm-empty)
   added: (holding b354) (clear b253)
   goals met: 5 of 15
54. (putdown b354)
   deleted: (holding b354)
   added: (clear b354) (arm-empty) (on-table b354)
   goals met: 5 of 15
55. (unstack b253 b273)
   deleted: (on b253 b273) (clear b253) (arm-empty)
   added: (holding b253) (clear b273)
   goals met: 5 of 15
56. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 5 of 15
57. (unstack b273 b29)
   deleted: (on b273 b29) (clear b273) (arm-empty)
   added: (holding b273) (clear b29)
   goals met: 5 of 15
58. (putdown b273)
   deleted: (holding b273)
   added: (clear b273) (arm-empty) (on-table b273)
   goals met: 5 of 15
59. (unstack b29 b67)
   deleted: (on b29 b67) (clear b29) (arm-empty)
   added: (holding b29) (clear b67)
   goals met: 5 of 15
60. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 5 of 15
61. (unstack b67 b1)
   deleted: (on b67 b1) (clear b67) (arm-empty)
   added: (holding b67) (clear b1)
   goals met: 5 of 15
62. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 5 of 15
63. (unstack b74 b181)
   deleted: (on b74 b181) (clear b74) (arm-empty)
   added: (holding b74) (clear b181)
   goals met: 5 of 15
64. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 5 of 15
65. (unstack b181 b119)
   deleted: (on b181 b119) (clear b181) (arm-empty)
   added: (holding b181) (clear b119)
   goals met: 5 of 15
66. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 5 of 15
67. (unstack b119 b215)
   deleted: (on b119 b215) (clear b119) (arm-empty)
   added: (holding b119) (clear b215)
   goals met: 5 of 15
68. (putdown b119)
   deleted: (holding b119)
   added: (clear b119) (arm-empty) (on-table b119)
   goals met: 5 of 15
69. (unstack b215 b10)
   deleted: (on b215 b10) (clear b215) (arm-empty)
   added: (holding b215) (clear b10)
   goals met: 6 of 15
70. (putdown b215)
   deleted: (holding b215)
   added: (clear b215) (arm-empty) (on-table b215)
   goals met: 6 of 15
71. (unstack b85 b234)
   deleted: (on b85 b234) (clear b85) (arm-empty)
   added: (holding b85) (clear b234)
   goals met: 6 of 15
72. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 6 of 15
73. (unstack b234 b46)
   deleted: (on b234 b46) (clear b234) (arm-empty)
   added: (holding b234) (clear b46)
   goals met: 6 of 15
74. (putdown b234)
   deleted: (holding b234)
   added: (clear b234) (arm-empty) (on-table b234)
   goals met: 6 of 15
75. (unstack b46 b4)
   deleted: (on b46 b4) (clear b46) (arm-empty)
   added: (holding b46) (clear b4)
   goals met: 6 of 15
76. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 6 of 15
77. (unstack b96 b176)
   deleted: (on b96 b176) (clear b96) (arm-empty)
   added: (holding b96) (clear b176)
   goals met: 6 of 15
78. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 6 of 15
79. (unstack b176 b359)
   deleted: (on b176 b359) (clear b176) (arm-empty)
   added: (holding b176) (clear b359)
   goals met: 6 of 15
80. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 6 of 15
81. (unstack b359 b347)
   deleted: (on b359 b347) (clear b359) (arm-empty)
   added: (holding b359) (clear b347)
   goals met: 6 of 15
82. (putdown b359)
   deleted: (holding b359)
   added: (clear b359) (arm-empty) (on-table b359)
   goals met: 6 of 15
83. (unstack b347 b136)
   deleted: (on b347 b136) (clear b347) (arm-empty)
   added: (holding b347) (clear b136)
   goals met: 6 of 15
84. (putdown b347)
   deleted: (holding b347)
   added: (clear b347) (arm-empty) (on-table b347)
   goals met: 6 of 15
85. (unstack b136 b89)
   deleted: (on b136 b89) (clear b136) (arm-empty)
   added: (holding b136) (clear b89)
   goals met: 6 of 15
86. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 6 of 15
87. (unstack b89 b3)
   deleted: (on b89 b3) (clear b89) (arm-empty)
   added: (holding b89) (clear b3)
   goals met: 6 of 15
88. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 6 of 15
89. (unstack b1 b309)
   deleted: (on b1 b309) (clear b1) (arm-empty)
   added: (holding b1) (clear b309)
   goals met: 6 of 15
90. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 7 of 15
91. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 7 of 15
92. (stack b11 b1)
   deleted: (clear b1) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b1)
   goals met: 8 of 15
93. (unstack b12 b148)
   deleted: (on b12 b148) (clear b12) (arm-empty)
   added: (holding b12) (clear b148)
   goals met: 8 of 15
94. (stack b12 b3)
   deleted: (clear b3) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b3)
   goals met: 9 of 15
95. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 9 of 15
96. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 10 of 15
97. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 10 of 15
98. (stack b9 b11)
   deleted: (clear b11) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b11)
   goals met: 11 of 15
99. (unstack b10 b238)
   deleted: (on b10 b238) (clear b10) (arm-empty)
   added: (holding b10) (clear b238)
   goals met: 10 of 15
100. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 12 of 15
101. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 11 of 15
102. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 13 of 15
103. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 12 of 15
104. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 12 of 15
105. (unstack b3 b388)
   deleted: (on b3 b388) (clear b3) (arm-empty)
   added: (holding b3) (clear b388)
   goals met: 12 of 15
106. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 13 of 15
107. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 13 of 15
108. (stack b12 b3)
   deleted: (clear b3) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b3)
   goals met: 14 of 15
109. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 12 of 15
110. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 13 of 15
111. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 12 of 15
112. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 12 of 15
113. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 11 of 15
114. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 13 of 15
115. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 12 of 15
116. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 12 of 15
117. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 11 of 15
118. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 11 of 15
119. (unstack b7 b108)
   deleted: (on b7 b108) (clear b7) (arm-empty)
   added: (holding b7) (clear b108)
   goals met: 11 of 15
120. (stack b7 b12)
   deleted: (clear b12) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b12)
   goals met: 12 of 15
121. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 12 of 15
122. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 13 of 15
123. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 13 of 15
124. (stack b11 b1)
   deleted: (clear b1) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b1)
   goals met: 14 of 15
125. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 12 of 15
126. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 13 of 15
127. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 13 of 15
128. (stack b9 b11)
   deleted: (clear b11) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b11)
   goals met: 14 of 15
129. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 13 of 15
130. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 15 of 15
